Revit 2027 API
PropertySetElement.SetEmbodiedCarbonAsset Method
 Sets a copy of the given EmbodiedCarbonAsset to be used in the PropertySetElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetEmbodiedCarbonAsset(
	EmbodiedCarbonAsset embodiedCarbonAsset
)
Public Sub SetEmbodiedCarbonAsset (
	embodiedCarbonAsset As EmbodiedCarbonAsset
)
public:
void SetEmbodiedCarbonAsset(
	EmbodiedCarbonAsset^ embodiedCarbonAsset
)
member SetEmbodiedCarbonAsset :
        embodiedCarbonAsset : EmbodiedCarbonAsset -> unit
Parameters
embodiedCarbonAsset EmbodiedCarbonAsset
Exceptions
Exception | Condition
ArgumentException |  Thrown when the name of the asset is empty, contains prohibited characters, or is not unique
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PropertySetElement Class
Autodesk.Revit.DB Namespace